Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            (None, 15)                0         
_________________________________________________________________
dense (Dense)                (None, 128)               2048      
_________________________________________________________________
dense_1 (Dense)              (None, 128)               16512     
_________________________________________________________________
dense_2 (Dense)              (None, 9)                 1161      
=================================================================
Total params: 19,721
Trainable params: 19,721
Non-trainable params: 0
_________________________________________________________________
